; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet14)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon16)
)
(:goal (and
	(pointing satellite1 Planet13)
	(pointing satellite2 Phenomenon11)
	(have_image Phenomenon3 infrared3)
	(have_image Planet4 spectrograph1)
	(have_image Star5 spectrograph2)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 spectrograph0)
	(have_image Star9 infrared3)
	(have_image Planet10 spectrograph2)
	(have_image Phenomenon11 spectrograph1)
	(have_image Star12 spectrograph1)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon15 spectrograph0)
	(have_image Phenomenon16 spectrograph1)
	(have_image Phenomenon17 spectrograph1)
	(have_image Phenomenon18 spectrograph0)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 16
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 16
4. (turn_to satellite4 groundstation2 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 groundstation2)
   goals met: 0 of 16
5. (calibrate satellite4 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 16
6. (turn_to satellite4 planet10 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 planet10)
   goals met: 0 of 16
7. (take_image satellite4 planet10 instrument6 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 1 of 16
8. (turn_to satellite4 star5 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star5)
   goals met: 1 of 16
9. (take_image satellite4 star5 instrument6 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 2 of 16
10. (turn_to satellite2 groundstation2 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation2)
   goals met: 2 of 16
11. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 2 of 16
12. (turn_to satellite2 phenomenon11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 16
13. (turn_to satellite1 planet13 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet13)
   goals met: 4 of 16
14. (turn_to satellite0 groundstation0 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 16
15. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 16
16. (turn_to satellite0 phenomenon11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 16
17. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 5 of 16
18. (turn_to satellite0 phenomenon15 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 16
19. (take_image satellite0 phenomenon15 instrument0 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 6 of 16
20. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 6 of 16
21. (take_image satellite0 phenomenon16 instrument0 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 7 of 16
22. (turn_to satellite0 phenomenon17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon17)
   goals met: 7 of 16
23. (take_image satellite0 phenomenon17 instrument0 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 8 of 16
24. (turn_to satellite0 phenomenon18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon18)
   goals met: 8 of 16
25. (take_image satellite0 phenomenon18 instrument0 spectrograph0)
   added: (have_image phenomenon18 spectrograph0)
   goals met: 9 of 16
26. (turn_to satellite0 phenomenon6 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon6)
   goals met: 9 of 16
27. (take_image satellite0 phenomenon6 instrument0 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 10 of 16
28. (turn_to satellite0 planet13 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet13)
   goals met: 10 of 16
29. (take_image satellite0 planet13 instrument0 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 11 of 16
30. (turn_to satellite0 planet4 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet4)
   goals met: 11 of 16
31. (take_image satellite0 planet4 instrument0 spectrograph1)
   added: (have_image planet4 spectrograph1)
   goals met: 12 of 16
32. (turn_to satellite0 star12 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star12)
   goals met: 12 of 16
33. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 13 of 16
34. (turn_to satellite0 star7 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star7)
   goals met: 13 of 16
35. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 14 of 16
36. (turn_to satellite2 phenomenon3 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon3)
   goals met: 13 of 16
37. (take_image satellite2 phenomenon3 instrument4 infrared3)
   added: (have_image phenomenon3 infrared3)
   goals met: 14 of 16
38. (turn_to satellite2 phenomenon11 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 phenomenon11)
   goals met: 15 of 16
39. (turn_to satellite2 star9 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star9)
   goals met: 14 of 16
40. (take_image satellite2 star9 instrument4 infrared3)
   added: (have_image star9 infrared3)
   goals met: 15 of 16
41. (turn_to satellite2 phenomenon11 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 phenomenon11)
   goals met: 16 of 16
